//百度地图行政区划adcode映射表
// 【更新至21年04月】	
// 逆地理编码服务、驾车路径规划等接口，使用的国家标准行政区划代码（adcode）映射表。持续更新
// 参考：http://lbsyun.baidu.com/index.php?title=open/dev-res

/*
功能：
1、维护标准的国家行政区划代码
2、方便应用程序根据区划名称等查对应的编码。或者根据百度地图返回的编码查城市信息
*/

//下面只是把国家标准中城市级别的编码取出，因为本需求只需要定位路线经过的城市的天气
let cityCodes={"石家庄市":130100,"大兴安岭地区":232700,"本溪市":210500,"朝阳市":211300,"丹东市":210600,"抚顺市":210400,"阜新市":210900,"葫芦岛市":211400,"锦州市":210700,"盘锦市":211100,"铁岭市":211200,"营口市":210800,"鞍山市":210300,"大连市":210200,"辽阳市":211000,"巴彦淖尔市":150800,"包头市":150200,"呼伦贝尔市":150700,"通辽市":150500,"锡林郭勒盟":152500,"呼和浩特市":150100,"阿拉善盟":152900,"日照市":371100,"青岛市":370200,"济南市":370100,"潍坊市":370700,"济宁市":370800,"阳泉市":140300,"上海市":310100,"天津市":120100,"巴音郭楞蒙古自治州":652800,"博尔塔拉蒙古自治州":652700,"昌吉回族自治州":652300,"哈密市":650500,"和田地区":653200,"喀什地区":653100,"塔城地区":654200,"阿勒泰地区":654300,"胡杨河市":659000,"伊犁哈萨克自治州":654000,"延边朝鲜族自治州":222400,"通化市":220500,"松原市":220700,"长春市":220100,"四平市":220300,"辽源市":220400,"白城市":220800,"吉林市":220200,"天水市":620500,"定西市":621100,"庆阳市":621000,"甘南藏族自治州":623000,"酒泉市":620900,"张掖市":620700,"金昌市":620300,"武威市":620600,"兰州市":620100,"白银市":620400,"平凉市":620800,"陇南市":621200,"嘉峪关市":620200,"仙桃市":429004,"景德镇市":360200,"宁德市":350900,"海北藏族自治州":632200,"海东市":630200,"海南藏族自治州":632500,"海西蒙古族藏族自治州":632800,"黄南藏族自治州":632300,"西宁市":630100,"果洛藏族自治州":632600,"玉树藏族自治州":632700,"延安市":610600,"榆林市":610800,"西安市":610100,"铜川市":610200,"广元市":510800,"巴中市":511900,"达州市":511700,"绵阳市":510700,"宜宾市":511500,"眉山市":511400,"凉山彝族自治州":513400,"乐山市":511100,"自贡市":510300,"大理白族自治州":532900,"文山壮族苗族自治州":532600,"临沧市":530900,"西双版纳傣族自治州":532800,"怒江傈僳族自治州":533300,"鹤壁市":410600,"焦作市":410800,"开封市":410200,"漯河市":411100,"南阳市":411300,"平顶山市":410400,"三门峡市":411200,"商丘市":411400,"济源市":419001,"新乡市":410700,"信阳市":411500,"郑州市":410100,"安阳市":410500,"洛阳市":410300,"毕节市":520500,"株洲市":430200,"湘潭市":430300,"岳阳市":430600,"长沙市":430100,"湘西土家族苗族自治州":433100,"常德市":430700,"衡阳市":430400,"娄底市":431300,"怀化市":431200,"郴州市":431000,"益阳市":430900,"昆玉市":659009,"嘉义市":719003,"桃园市":710600,"台北市":710100,"台中市":710400,"新北市":710300,"台南市":710500,"高雄市":710200,"新竹市":719002,"嘉义县":719010,"云林县":719008,"屏东县":719011,"南投县":719009,"花莲县":719013,"彰化县":719007,"台东县":719012,"宜兰县":719005,"苗栗县":719006,"新竹县":719004,"无锡市":320200,"沈阳市":210100,"永州市":431100,"邯郸市":130400,"苏州市":320500,"张家界市":430800,"驻马店市":411700,"常州市":320400,"徐州市":320300,"淮安市":320800,"扬州市":321000,"盐城市":320900,"连云港市":320700,"宿迁市":321300,"南京市":320100,"镇江市":321100,"泰州市":321200,"南通市":320600,"邵阳市":430500,"周口市":411600,"许昌市":411000,"濮阳市":410900,"南昌市":360100,"抚州市":361000,"新余市":360500,"萍乡市":360300,"晋城市":140500,"阿克苏地区":652900,"成都市":510100,"雅安市":511800,"德阳市":510600,"阿拉尔市":659002,"克孜勒苏柯尔克孜自治州":653000,"北屯市":659005,"阿坝藏族羌族自治州":513200,"甘孜藏族自治州":513300,"南充市":511300,"赤峰市":150400,"鄂尔多斯市":150600,"拉萨市":540100,"昌都市":540300,"林芝市":540400,"九江市":360400,"铁门关市":659006,"十堰市":420300,"安康市":610900,"商洛市":611000,"襄阳市":420600,"神农架林区":429021,"咸阳市":610400,"宝鸡市":610300,"汉中市":610700,"渭南市":610500,"咸宁市":421200,"恩施土家族苗族自治州":422800,"临汾市":141000,"大同市":140200,"长治市":140400,"孝感市":420900,"天门市":429006,"荆门市":420800,"宜昌市":420500,"武汉市":420100,"潜江市":429005,"荆州市":421000,"澎湖县":719014,"吕梁市":141100,"太原市":140100,"晋中市":140700,"朔州市":140600,"运城市":140800,"上饶市":361100,"山南市":540500,"日喀则市":540200,"那曲市":540600,"阿里地区":542500,"鄂州市":420700,"随州市":421300,"黄冈市":421100,"黄石市":420200,"重庆市":500100,"菏泽市":371700,"兴安盟":152200,"忻州市":140900,"莆田市":350300,"吉安市":360800,"宜春市":360900,"赣州市":360700,"鹰潭市":360600,"广安市":511600,"泸州市":510500,"内江市":511000,"攀枝花市":510400,"遂宁市":510900,"资阳市":512000,"可克达拉市":659008,"烟台市":370600,"乌鲁木齐市":650100,"吐鲁番市":650400,"克拉玛依市":650200,"五家渠市":659004,"石河子市":659001,"图木舒克市":659003,"双河市":659007,"三明市":350400,"泉州市":350500,"龙岩市":350800,"福州市":350100,"南平市":350700,"厦门市":350200,"漳州市":350600,"乌兰察布市":150900,"乌海市":150300,"白山市":220600,"滨州市":371600,"德州市":371400,"淄博市":370300,"枣庄市":370400,"泰安市":370900,"聊城市":371500,"威海市":371000,"临夏回族自治州":622900,"伊春市":230700,"大庆市":230600,"哈尔滨市":230100,"鹤岗市":230400,"黑河市":231100,"鸡西市":230300,"佳木斯市":230800,"牡丹江市":231000,"七台河市":230900,"齐齐哈尔市":230200,"双鸭山市":230500,"绥化市":231200,"贵阳市":520100,"安顺市":520400,"六盘水市":520200,"黔东南苗族侗族自治州":522600,"黔南布依族苗族自治州":522700,"黔西南布依族苗族自治州":522300,"铜仁市":520600,"遵义市":520300,"合肥市":340100,"滁州市":341100,"安庆市":340800,"蚌埠市":340300,"亳州市":341600,"池州市":341700,"阜阳市":341200,"淮北市":340600,"淮南市":340400,"黄山市":341000,"六安市":341500,"马鞍山市":340500,"铜陵市":340700,"芜湖市":340200,"宿州市":341300,"宣城市":341800,"保定市":130600,"张家口市":130700,"邢台市":130500,"唐山市":130200,"秦皇岛市":130300,"廊坊市":131000,"衡水市":131100,"承德市":130800,"沧州市":130900,"固原市":640400,"石嘴山市":640200,"吴忠市":640300,"银川市":640100,"中卫市":640500,"昆明市":530100,"曲靖市":530300,"保山市":530500,"楚雄彝族自治州":532300,"德宏傣族景颇族自治州":533100,"迪庆藏族自治州":533400,"红河哈尼族彝族自治州":532500,"丽江市":530700,"普洱市":530800,"玉溪市":530400,"昭通市":530600,"临沂市":371300,"东营市":370500,"北京市":110100,"基隆市":719001,"贺州市":451100,"河源市":441600,"阳江市":441700,"云浮市":445300,"湛江市":440800,"江门市":440700,"中山市":442000,"东莞市":441900,"深圳市":440300,"南宁市":450100,"海口市":460100,"柳州市":450200,"金华市":330700,"台州市":331000,"嘉兴市":330400,"丽水市":331100,"衢州市":330800,"宁波市":330200,"绍兴市":330600,"杭州市":330100,"湖州市":330500,"温州市":330300,"三亚市":460200,"舟山市":330900,"万宁市":469006,"东方市":469007,"临高县":469024,"乐东黎族自治县":469027,"五指山市":469001,"保亭黎族苗族自治县":469029,"儋州市":460400,"定安县":469021,"屯昌县":469022,"文昌市":469005,"昌江黎族自治县":469026,"澄迈县":469023,"琼中黎族苗族自治县":469030,"琼海市":469002,"白沙黎族自治县":469025,"陵水黎族自治县":469028,"澳门":820000,"香港":810000,"桂林市":450300,"百色市":451000,"北海市":450500,"防城港市":450600,"贵港市":450800,"河池市":451200,"钦州市":450700,"梧州市":450400,"玉林市":450900,"崇左市":451400,"来宾市":451300,"广州市":440100,"肇庆市":441200,"惠州市":441300,"揭阳市":445200,"清远市":441800,"佛山市":440600,"珠海市":440400,"韶关市":440200,"潮州市":445100,"茂名市":440900,"梅州市":441400,"汕头市":440500,"汕尾市":441500,"三沙市":460300,"海域":999900};

/**
 * 用于根据百度地图返回的adcode找到所属的城市（仅仅是城市，不需要到下面级别）
 * @param {百度地图返回的adcode的前四位} codeWithFourLength 
 */
function findCity(codeWithFourLength){
    if(codeWithFourLength && codeWithFourLength.length >4){
        codeWithFourLength = codeWithFourLength.substr(0,4);
    }
    for(let k in cityCodes){
        if(cityCodes[k].toString().substr(0,4)===codeWithFourLength)
            return k;
    }
}
module.exports ={
    findCity
}

